Okay so i just added the following to my config
```
resource "harbor_project" "test" {
  name                 = "test1234"
}

resource "harbor_robot_account" "project-test" {
  name        = "example"
  description = "project level robot account"
  level       = "project"
  permissions {
    access {
      action   = "pull"
      resource = "repository"
    }
    kind      = "project"
    namespace = harbor_project.test.name
  }
}
```

Command-Line:
```
$ tofu apply

< Refreshing State >

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # harbor_project.test will be created
  + resource "harbor_project" "test" {
      + auto_sbom_generation        = false
      + enable_content_trust        = false
      + enable_content_trust_cosign = false
      + force_destroy               = false
      + id                          = (known after apply)
      + name                        = "test1234"
      + project_id                  = (known after apply)
      + public                      = false
      + registry_id                 = (known after apply)
      + storage_quota               = -1
      + vulnerability_scanning      = true
    }

  # harbor_robot_account.project-test will be created
  + resource "harbor_robot_account" "project-test" {
      + description = "project level robot account"
      + disable     = false
      + duration    = -1
      + full_name   = (known after apply)
      + id          = (known after apply)
      + level       = "project"
      + name        = "example"
      + robot_id    = (known after apply)
      + secret      = (sensitive value)

      + permissions {
          + kind      = "project"
          + namespace = "test1234"

          + access {
              + action   = "pull"
              + resource = "repository"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

harbor_project.test: Creating...
harbor_project.test: Creation complete after 0s [id=/projects/18]
harbor_robot_account.project-test: Creating...
harbor_robot_account.project-test: Creation complete after 0s [id=/robots/217]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

<outputs ...>

$ tofu apply
< Refreshing State ... >

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # harbor_robot_account.project-test must be replaced
-/+ resource "harbor_robot_account" "project-test" {
      ~ full_name   = "robot$test1234+example" -> (known after apply)
      ~ id          = "/robots/217" -> (known after apply)
      ~ name        = "test1234+example" -> "example" # forces replacement
      ~ robot_id    = "217" -> (known after apply)
      ~ secret      = (sensitive value)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
<Changes to Outputs ...>

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

harbor_robot_account.project-test: Destroying... [id=/robots/217]
harbor_robot_account.project-test: Destruction complete after 0s
harbor_robot_account.project-test: Creating...
harbor_robot_account.project-test: Creation complete after 0s [id=/robots/218]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

Outputs:

<outputs ...>
```


So i don't actually need to change the config, but it will destroy and recreate the robot-account if i don't.
The robot-user shouldn't be recreated, when the config didn't change